Repository: Albert-Ludwig/X20CP1586_ABB_B-R_robot
Catalog: Logical/mappView/Resources/Texts/LocalizableTexts.tmx
Source language: en
Languages: zh

source: Hello, welcome to the B&R human-computer interface homepage.
zh: 你好，欢迎来到贝加莱自动化人机界面！

source: Main Page
zh: 主界面

source: Position
zh: 位置

source: Service Page
zh: 诊断界面_SDM

source: Setting Page
zh: 设置界面

source: Adjust Time
zh: 时间调整界面

source: Hi! This page is the time-adjustement; please enter the targeted new time into the box.
zh: 这里是时间调整界面，请在方框中输入更改后的时间：

source: Adjust Theme
zh: 主题效果

source: Program monitor
zh: 程序监控

source: Unit & Language setting
zh: 单位及其语言设置

source: Hi! This is the regional setting, includes unit, language and other related settings. We offer Chinese and Canadian English, and standard metric unit and imperial unit. Attention: the imperial unit is not exactly fulfill the traditional habit of the imperial unit, please check ther actual performance.
zh: 您好，欢迎来到语言与单位设置页面。该页面包含区域偏好设置； 语言选项提供中文与英文，单位提供英制单位和公制单位。 注意：英制单位并非是标准化英制单位，需查看实际表现来进行调整和更改。

source: Manual Page
zh: 手动模式

source: Hi! This is the manual mode, you can enter the destination coordinate into the box, and click the button "move". Attention, you can not use the "Run" button in the manual mode since this is the button for running a program. If you want to modify other buttons, you can back to the main page to adjust them.
zh: 您好，欢迎来到手动模式。您可以输入目标点的笛卡尔坐标并且按下“move“按钮来完成移动。 注意：由于手动模式是根据输入坐标移动，因此无法使用”Run“按钮来运行程序。 如果想要对其他按钮（ie. power）进行操作，请返回Main page。

source: Program Selection
zh: 程序选择

source: Information Display
zh: 信息显示

source: Path Velocity:
zh: 路径速度:

source: Line Number:
zh: 当前运行行数:

source: Status ID:
zh: 状态代码:

source: Overall Runtime:
zh: 总运行时间:

source: Movement Runtime:
zh: 机器人运动时间:

source: Log in Page
zh: 登陆界面

source: Selected User:
zh: 选择用户:

source: Role Name:
zh: 角色:

source: Documentation Page
zh: 说明书/文档

source: User_1 is Adminstrator
zh: 用户User_1的权限为(Adminstrator)全权限管理员

source: User_2 is Miantainer
zh: 用户User_2的权限为(Maintain)维护人员

source: User_3 is Operator
zh: 用户User_3的权限为(Operator)操作工
